Rails/recipe-book/app/controllers/recipe_books_controller.rb

  def index
    @recipe_books = RecipeBook.all
---
SELECT "recipe_books".* FROM "recipe_books"

  def create
    @recipe_book = RecipeBook.new(recipe_book_params)

    respond_to do |format|
      if @recipe_book.save
---
INSERT INTO "recipe_books" ("recipe_name", "recipe_description", "submitted_by", "time_to_prepare", "rating", "difficulty", "category", "ingredients", "instructions", "comments", "vegetarian", "vegan", "gluten_free", "dairy_free", "keto", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @recipe_book.update(recipe_book_params)
---
UPDATE "recipe_books" SET "ingredients" = ?, "updated_at" = ? WHERE "recipe_books"."id" = ?  [["ingredients", "Chicken, Salt, Pepper, and Thyme\r\nCayenne\r\n"], ["updated_at", "2022-01-03 22:22:23.832299"], ["id", 2]]

  def destroy
    @recipe_book.destroy
---
DELETE FROM "recipe_books" WHERE "recipe_books"."id" = ?  [["id", 1]]

    def set_recipe_book
      @recipe_book = RecipeBook.find(params[:id])
---
SELECT "recipe_books".* FROM "recipe_books" WHERE "recipe_books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]